# go-calculator

## Usage

```
$ go run cmd/calculator/main.go
calculator> (1.2 + 2.5) * 2.0
7.4
calculator> -sin((-1+2.5)*pi)
1
calculator> 180*atan2(log(e), log10(10))/pi
45
calculator> exit
```

## References

* [chibicc](https://github.com/rui314/chibicc): A small C compiler